---
title: FluidTemperatureSetIterator
classe: Autodesk.Revit.DB.Plumbing.FluidTemperatureSetIterator
namespace: Autodesk.Revit.DB.Plumbing
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# FluidTemperatureSetIterator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FluidTemperature Current { get; }` | `fluidTemperatureSetIterator.Current` | FluidTemperature |
| `Boolean IsValidObject { get; }` | `fluidTemperatureSetIterator.IsValidObject` | Boolean |
| `Void Dispose()` | `fluidTemperatureSetIterator.Dispose()` | Void |
| `FluidTemperature GetCurrent()` | `fluidTemperatureSetIterator.GetCurrent()` | FluidTemperature |
| `Boolean IsDone()` | `fluidTemperatureSetIterator.IsDone()` | Boolean |
| `Boolean MoveNext()` | `fluidTemperatureSetIterator.MoveNext()` | Boolean |
| `Void Reset()` | `fluidTemperatureSetIterator.Reset()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```